---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.ConceptualSurfaceType
source: html/4c3e2cd4-0412-092e-98d4-378e297015eb.htm
---
# ConceptualSurfaceType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.